<?php
/**
* +----------------------------------------------------------------------
* 创建日期：2018年8月10日20:40:38
* 最新修改时间：2018年8月10日20:40:38
* +----------------------------------------------------------------------
* https：//github.com/ALNY-AC
* +----------------------------------------------------------------------
* 微信：AJS0314
* +----------------------------------------------------------------------
* QQ:1173197065
* +----------------------------------------------------------------------
* #####魔方控制器#####
* @author 代码狮
*
*/
namespace Home\Controller;
use Think\Controller;
class CubeController extends Controller{
    
    public function getHome(){
        
        $res['res']=1;
        $res['msg']='4a9ab6c2e3f83e3abff73978d69936dc';
        echo json_encode($res);
        
    }
    
    public function getKill(){
        
        $res['res']=1;
        $res['msg']='';
        echo json_encode($res);
        
    }
    
}