<?php
/**
* +----------------------------------------------------------------------
* 创建日期：2018年8月31日22:23:05
* 最新修改时间：2018年8月31日22:23:05
* +----------------------------------------------------------------------
* https：//github.com/ALNY-AC
* +----------------------------------------------------------------------
* 微信：AJS0314
* +----------------------------------------------------------------------
* QQ:1173197065
* +----------------------------------------------------------------------
* #####版本控制#####
* @author 代码狮
*
*/
namespace Home\Controller;
use Think\Controller;
class VersionController extends CommonController{
    
    
    public function inspect(){
        
        $version='1.5.8';
        $app_version=I('app_version');
        
        if($app_version!=$version){
            // ===================================================================================
            // 需要更新
            $res['res']=1;
            $res['url']="http://server.followenjoy.cn/download/followenjoy$version.apk";
            
        }else{
            // ===================================================================================
            // 不需要更新
            $res['res']=0;
        }
        
        echo json_encode($res);
        
    }
    
}