<?php
/**
* +----------------------------------------------------------------------
* 创建日期：2018年8月24日10:59:46
* 最新修改时间：2018年8月24日10:59:46
* +----------------------------------------------------------------------
* https：//github.com/ALNY-AC
* +----------------------------------------------------------------------
* 微信：AJS0314
* +----------------------------------------------------------------------
* QQ:1173197065
* +----------------------------------------------------------------------
* #####一元商品用户模型#####
* @author 代码狮
*
*/
namespace Common\Model;
use Think\Model;
class OneGoodsUserModel extends Model {
    
    
    public function is($user_id,$goods_id){
        $where=[];
        $where['user_id']=$user_id;
        $where['goods_id']=$goods_id;
        return $this->where($where)->find();
    }
    
    
}