<?php
/**
* +----------------------------------------------------------------------
* 创建日期：2018年6月16日10:40:47
* 最新修改时间：2018年6月16日10:40:47
* +----------------------------------------------------------------------
* https：//github.com/ALNY-AC
* +----------------------------------------------------------------------
* 微信：AJS0314
* +----------------------------------------------------------------------
* QQ:1173197065
* +----------------------------------------------------------------------
* #####浏览记录模型#####
* @author 代码狮
*
*/
namespace Home\Model;
use Think\Model;
class RecordModel extends Model {
    
    
    public function create($data){
        
        $data['record_id']=getMd5('record');
        $data['add_time']=time();
        $data['edit_time']=time();
        
        return $this->add($data);
    }
    
    
    
}