<?php
/**
* +----------------------------------------------------------------------
* 创建日期：2018年7月3日13:54:11
* 最新修改时间：2018年7月3日13:54:11
* +----------------------------------------------------------------------
* https：//github.com/ALNY-AC
* +----------------------------------------------------------------------
* 微信：AJS0314
* +----------------------------------------------------------------------
* QQ:1173197065
* +----------------------------------------------------------------------
* #####魔方行控制器#####
* @author 代码狮
*
*/
namespace Admin\Controller;
use Think\Controller;
class CubeRowController extends CommonController{
    
    //构造函数
    public function _initialize(){
        
    }
    //主
    public function index(){
        
    }
    //空操作
    public function _empty(){
        
    }
    
}