<?php
/**
* +----------------------------------------------------------------------
* 创建日期：2018年6月28日11:15:08
* 最新修改时间：2018年6月28日11:15:08
* +----------------------------------------------------------------------
* https：//github.com/ALNY-AC
* +----------------------------------------------------------------------
* 微信：AJS0314
* +----------------------------------------------------------------------
* QQ:1173197065
* +----------------------------------------------------------------------
* #####魔方设计系统控制器#####
* @author 代码狮
*
*/

namespace Admin\Controller;
use Think\Controller;
class MagicCubeController extends CommonController{
    
    
    //主
    public function test(){
        echo 1;
        
    }
    public function _empty(){
        // MagicCube
    }
    
}